#+ORG2BLOG:
#+BLOG: wisdomandwonder
#+POSTID: 10733
#+DATE: [2018-01-06 Sat 01:58]
#+OPTIONS: toc:nil num:nil todo:nil pri:nil tags:nil ^:nil
#+CATEGORY: Programming Language,
#+TAGS: Programming Language, Bash, macOS
#+TITLE: Find All Locations Of A Binary Using `type' not `which'

I can't find the ~git~ 2.10 binary so I run

#+NAME: org_gcr_2018-01-06_mara_69ABC15C-36F7-41BF-A371-74BB2151435A
#+BEGIN_SRC sh
which git
#+END_SRC

#+RESULTS: org_gcr_2018-01-06_mara_69ABC15C-36F7-41BF-A371-74BB2151435A
#+BEGIN_EXAMPLE
/usr/local/bin/git
#+END_EXAMPLE

Excellent, found it.

And then I check it's version to verify I am looking at the right version

#+NAME: org_gcr_2018-01-06_mara_9700318B-01A1-4B82-818B-333B3D3909DE
#+BEGIN_SRC sh
/usr/local/bin/git --version
#+END_SRC

#+RESULTS: org_gcr_2018-01-06_mara_9700318B-01A1-4B82-818B-333B3D3909DE
#+BEGIN_EXAMPLE
git version 2.15.1
#+END_EXAMPLE

Oops that isn't what I wanted.

There must be another ~git~ getting loaded earlier in the search path.

Here is how to find out where /all/ copies of ~git~ live

#+NAME: org_gcr_2018-01-06_mara_E19D5B7C-7919-4D69-86B3-6A8A2654F5C3
#+BEGIN_SRC sh
type -a git
#+END_SRC

#+RESULTS: org_gcr_2018-01-06_mara_E19D5B7C-7919-4D69-86B3-6A8A2654F5C3
#+BEGIN_EXAMPLE
git is /usr/local/bin/git
git is /usr/local/bin/git
git is /usr/bin/git
#+END_EXAMPLE

Look for the right ~git~ at version 2.10

#+NAME: org_gcr_2018-01-06_mara_AFF0427B-55A4-4B0F-96C7-16AB4A9A478F
#+BEGIN_SRC sh
/usr/local/bin/git --version
/usr/bin/git --version
#+END_SRC

#+RESULTS: org_gcr_2018-01-06_mara_AFF0427B-55A4-4B0F-96C7-16AB4A9A478F
#+BEGIN_EXAMPLE
git version 2.15.1
git version 2.10.1 (Apple Git-78)
#+END_EXAMPLE

I want the second one.

That is how to track down the location of a binary file on macOS that appears
multiple times in the search path.
